import unittest
import lab_5

class TestMath(unittest.TestCase):

    # Проверка результата при высоте = 0
    def test_height_0(self):
        self.assertEqual(lab_5.gen_bin_tree(height=0), {'6':[]})
    # Проверка результата при высоте = 1
    def test_height_1(self):
        self.assertEqual(lab_5.gen_bin_tree(height=1), {'6':[{'10': []}, {'10': []}]})
    # Проверка результата при высоте = 2
    def test_height_2(self):
        self.assertEqual(lab_5.gen_bin_tree(height=2), {'6':[{'10': [{'18': []}, {'14': []}]}, {'10': [{'18': []}, {'14':[]}]}]})
    # Проверка результата при высоте = 3
    def test_height_3(self):
        self.assertEqual(lab_5.gen_bin_tree(height=3), {'6':[{'10': [{'18': [{'34': []}, {'22': []}]}, {'14': [{'26': []}, {'18': []}]}]}, {'10': [{'18': [{'34': []}, {'22': []}]}, {'14':[{'26': []}, {'18': []}]}]}]})
    # Проверка результата при высоте = 4
    def test_height_4(self):
        self.assertEqual(lab_5.gen_bin_tree(height=4), {'6': [{'10': [{'18': [{'34': [{'66': []}, {'38': []}]}, {'22': [{'42': []}, {'26': []}]}]}, {'14': [{'26': [{'50': []}, {'30': []}]}, {'18': [{'34': []}, {'22': []}]}]}]}, {'10': [{'18': [{'34': [{'66': []}, {'38': []}]}, {'22': [{'42': []}, {'26': []}]}]}, {'14': [{'26': [{'50': []}, {'30': []}]}, {'18': [{'34': []}, {'22': []}]}]}]}]})
    # Проверка результата при высоте = 5
    def test_height_5(self):
        self.assertEqual(lab_5.gen_bin_tree(height=5), {'6': [{'10': [{'18': [{'34': [{'66': [{'130': []}, {'70': []}]}, {'38': [{'74': []}, {'42': []}]}]}, {'22': [{'42': [{'82': []}, {'46': []}]}, {'26': [{'50': []}, {'30': []}]}]}]}, {'14': [{'26': [{'50': [{'98': []}, {'54': []}]}, {'30': [{'58': []}, {'34': []}]}]}, {'18': [{'34': [{'66': []}, {'38': []}]}, {'22': [{'42': []}, {'26': []}]}]}]}]}, {'10': [{'18': [{'34': [{'66': [{'130': []}, {'70': []}]}, {'38': [{'74': []}, {'42': []}]}]}, {'22': [{'42': [{'82': []}, {'46': []}]}, {'26': [{'50': []}, {'30': []}]}]}]}, {'14': [{'26': [{'50': [{'98': []}, {'54': []}]}, {'30': [{'58': []}, {'34': []}]}]}, {'18': [{'34': [{'66': []}, {'38': []}]}, {'22': [{'42': []}, {'26': []}]}]}]}]}]})
    # Проверка результата, если корень - не целое число
    def test_root_not_int(self):
        self.assertEqual(lab_5.gen_bin_tree(root='a'), None)
    # Проверка результата, если высота - не целое число
    def test_height_not_int(self):
        self.assertEqual(lab_5.gen_bin_tree(height=[0]), None)
    # Проверка результата, если левая ветка - не формула
    def test_left_leaf_not_formula(self):
        self.assertEqual(lab_5.gen_bin_tree(left_leaf='a'), None)
    # Проверка результата, если правая ветка - не формула
    def test_right_leaf_not_formula(self):
        self.assertEqual(lab_5.gen_bin_tree(right_leaf=2), None)

if __name__ == '__main__':
    unittest.main()

